{
  "backend/main.mo": "Motoko backend storing per-user game design data with access control and admin-editable master prompt.",
  "feature_evidence.json": "Feature evidence report detailing required updates to the GDD template's competition mechanics section.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files, including templates, hooks, pages, and components.",
  "frontend/index.css": "Tailwind base/theme definitions with OKLCH color tokens and dark mode variables.",
  "frontend/index.html": "Minimal HTML root that loads the React app entrypoint.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for GDD and Plan Input pages using AppShell.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling auth state, errors, and query cache clearing.",
  "frontend/src/components/gdd/GddExportActions.tsx": "Buttons for printing the GDD and downloading it as Markdown.",
  "frontend/src/components/gdd/GddSectionAccordion.tsx": "Accordion renderer for GDD sections with HTML formatting of Markdown-like syntax.",
  "frontend/src/components/gdd/SaveStatusBar.tsx": "Status bar showing authentication, save status, and save action button.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout with header, navigation tabs, footer, and login button wrapping routed pages.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, login state, and provides identity context to the app.",
  "frontend/src/hooks/usePlanInputState.ts": "Stores and updates plan input data, merges it into the GDD template, and syncs with backend user data.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user game data and roles via the backend actor.",
  "frontend/src/index.css": "Tailwind-based global styles, theme variables, print styles, and custom scrollbar definitions.",
  "frontend/src/lib/gddExport.ts": "Generates and downloads a Markdown-formatted GDD document from section data.",
  "frontend/src/lib/gddMerge.ts": "Replaces placeholders in GDD template sections with user plan input values for plan-dependent sections.",
  "frontend/src/lib/gddTemplate.ts": "Defines the GDD section interface, a placeholder constant, and a large static template of game design sections.",
  "frontend/src/lib/planInputSchema.ts": "Defines plan input fields, default values, and a parser that maps user inputs to structured GDD fields with fallbacks.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the main App component.",
  "frontend/src/pages/GddPage.tsx": "Displays the generated GDD with loading skeletons, save status, export actions, and an accordion of sections.",
  "frontend/src/pages/PlanInputPage.tsx": "Provides a form for editing plan input fields, showing save status, structured inputs, and a raw plan text area.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, writing, persisting, and clearing URL and session parameters, including hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended colors, fonts, animations, container settings, and plugins.",
  "project_state.json": "Tracks the project’s current GDD and architecture progress, noting Phase 1 completion, required updates to the competition/market section, and outlines the planned 5‑canister ICP backend. Also records architectural notes, known missing source materials, and existing feature definitions for the app."
}